design_model/src/main/resources/行为型模式/职责链模式/职责链模式.md
```mermaid
classDiagram
    class Handler {
        <<Abstract>>
        -Handler successor;
        +void setSuccessor(Handler successor);
        +handlerRequest()*
    }
    class ConcreteHandlerA {
        +handlerRequest();
    }
    class ConcreteHandlerB {
        +handlerRequest();
    }
    ConcreteHandlerA --|> Handler
    ConcreteHandlerB --|> Handler
    Client --|> Handler
    Handler o-- Handler : successor
```
